Tekla.Structures.ModelInternal.BentPlate.LateralBoundaryType
The type of the lateral boundary of a bent plate

Tekla.Structures.ModelInternal.BentPlate.LateralBoundaryType.STRAIGHT_WHEN_UNFOLDED
The lateral boundary is a straight line when the section is unfolded.

Tekla.Structures.ModelInternal.BentPlate.LateralBoundaryType.STRAIGHT_ON_PLANE
The lateral boundary is a straight line when projected onto a plane.

Tekla.Structures.ModelInternal.BentPlate.LateralBoundaryType.POLYGON
The lateral boundary is an open polygon when the section is unfolded.